### 웹 크롤링 환경 설정 가이드 ###

# 1. 크롬 설치
# : 웹 크롤링은 크롬, 파이어폭스, 사파리 등 다양한 웹 브라우저에서 가능
# : 크롬에 있는 '개발자 도구'를 이용하여
#   크롤링 수행 시 필요한 정보 확인 가능
# 마이크로소프트 엣지(개발자 도구), 파이어폭스(파이어버그)에서도 확인 가능

# 2. requests 라이브러리 설치
# : 사용자가 서버에 요청하는 request를 용이하게 수행하는 라이브러리
# : 웹 페이지의 HTML을 가져오는 데 사용 (웹 문서의 구조를 가져옴)
# - 명령어를 사용한 라이브러리 설치
# a. 명령 프롬프트(cmd) 또는 터미널을 엽니다.
# b. pip install requests (설치 명령어를 입력합니다.)
# c. 설치 후 pip list 명령어를 입력하여 requests가 목록에 있는지 확인

# - 파이참에서 외부 라이브러리 설치
# a. 설정(Settings) 열기
# : Windows(File-Settings) / MacOS(PyCharm-Preferences)를 선택
# b. 프로젝트 인터프리터(Project Interpreter) 접근
# : 왼쪽 패널의 Project: 프로젝트명 > Python Interpreter 선택
# c. 라이브러리 설치
# : + 버튼 클릭: 설치하고자 하는 라이브러리 이름을 검색





